#+LATEX_CLASS: article
#+LaTeX_HEADER: \usepackage{minted}
#+LaTeX_HEADER: \usemintedstyle{}
#+LaTeX_HEADER: \usepackage[hidehyperlinks]{hyperref}

*** glm (General Linear Model) é uma regressão logística
    A função =glm= é extremamente poderosa, e no caso a sintaxe lê-se
    como: faça um modelo linear de forma com que prediza-se a morte 
#+NAME: d160d4e1-8dee-4daa-b499-99b1ebb1aac3
#+begin_src ein-r :session localhost :results output
glm_heart_model <- glm(formula = morte ~ ., data = heart_data[train, ], family = "binomial")
#+end_src

#+RESULTS: d160d4e1-8dee-4daa-b499-99b1ebb1aac3

#+NAME: 21dc6a32-466e-4958-8d4b-9a31a4fe367a
#+begin_src ein-r :session localhost :results output
  glm_heart_predict <- predict(object = glm_heart_model, newdata = heart_data[test, ], type = "response")

  glm_heart_classes <- ifelse(glm_heart_predict > 0.5, 1, 0)


  success_rates["logistic"] <- round(mean(ifelse(glm_heart_classes == heart_data[test, "morte"], 1, 0)), digits = 2)

  success_rates["logistic"]

  table(glm_heart_classes, heart_data[test, "morte"])
#+end_src

#+RESULTS: 21dc6a32-466e-4958-8d4b-9a31a4fe367a


- *logistic*: 0.85 
	|-------------------+----+----|
	| glm_heart_classes |  0 |  1 |
	|                 0 | 38 |  4 |
	|                 1 |  5 | 13 |
	|-------------------+----+----|


#+NAME: 2c6f8b44-704e-4cb8-829d-0970a862c1bb
#+begin_src ein-r :session localhost :results output
  summary(heart_data)
#+end_src

#+RESULTS: 2c6f8b44-704e-4cb8-829d-0970a862c1bb
#+begin_example
      age            anemia       creatinofosfoquinase    diabetes     
 Min.   :40.00   Min.   :0.0000   Min.   :  23.0       Min.   :0.0000  
 1st Qu.:51.00   1st Qu.:0.0000   1st Qu.: 116.5       1st Qu.:0.0000  
 Median :60.00   Median :0.0000   Median : 250.0       Median :0.0000  
 Mean   :60.83   Mean   :0.4314   Mean   : 581.8       Mean   :0.4181  
 3rd Qu.:70.00   3rd Qu.:1.0000   3rd Qu.: 582.0       3rd Qu.:1.0000  
 Max.   :95.00   Max.   :1.0000   Max.   :7861.0       Max.   :1.0000  
 fracao_ejecao_normal  pressao_alta      plaquetas      serum_creatinina
 Min.   :14.00        Min.   :0.0000   Min.   : 25100   Min.   :0.500   
 1st Qu.:30.00        1st Qu.:0.0000   1st Qu.:212500   1st Qu.:0.900   
 Median :38.00        Median :0.0000   Median :262000   Median :1.100   
 Mean   :38.08        Mean   :0.3512   Mean   :263358   Mean   :1.394   
 3rd Qu.:45.00        3rd Qu.:1.0000   3rd Qu.:303500   3rd Qu.:1.400   
 Max.   :80.00        Max.   :1.0000   Max.   :850000   Max.   :9.400   
  serum_sodio         sexo           fumante          horario     
 Min.   :113.0   Min.   :0.0000   Min.   :0.0000   Min.   :  4.0  
 1st Qu.:134.0   1st Qu.:0.0000   1st Qu.:0.0000   1st Qu.: 73.0  
 Median :137.0   Median :1.0000   Median :0.0000   Median :115.0  
 Mean   :136.6   Mean   :0.6488   Mean   :0.3211   Mean   :130.3  
 3rd Qu.:140.0   3rd Qu.:1.0000   3rd Qu.:1.0000   3rd Qu.:203.0  
 Max.   :148.0   Max.   :1.0000   Max.   :1.0000   Max.   :285.0  
     morte       
 Min.   :0.0000  
 1st Qu.:0.0000  
 Median :0.0000  
 Mean   :0.3211  
 3rd Qu.:1.0000  
 Max.   :1.0000  
#+end_example

